# Advanced Dataframes Exercises

In [47]:
import pandas as pd
from pydataset import data
import numpy as np

## 1. Load the mpg dataset. Read the documentation for it, and use the data to answer these questions:

In [48]:
mpg = data('mpg') # load the dataset and store it in a variable

In [49]:
data('mpg', show_doc=True) # view the documentation for the dataset

mpg

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Fuel economy data from 1999 and 2008 for 38 popular models of car

### Description

This dataset contains a subset of the fuel economy data that the EPA makes
available on http://fueleconomy.gov. It contains only models which had a new
release every year between 1999 and 2008 - this was used as a proxy for the
popularity of the car.

### Usage

    data(mpg)

### Format

A data frame with 234 rows and 11 variables

### Details

  * manufacturer.

  * model.

  * displ. engine displacement, in litres

  * year.

  * cyl. number of cylinders

  * trans. type of transmission

  * drv. f = front-wheel drive, r = rear wheel drive, 4 = 4wd

  * cty. city miles per gallon

  * hwy. highway miles per gallon

  * fl.

  * class.

In [50]:
mpg.head(10) #Lets look at a few rows of our dataframe

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact
6,audi,a4,2.8,1999,6,manual(m5),f,18,26,p,compact
7,audi,a4,3.1,2008,6,auto(av),f,18,27,p,compact
8,audi,a4 quattro,1.8,1999,4,manual(m5),4,18,26,p,compact
9,audi,a4 quattro,1.8,1999,4,auto(l5),4,16,25,p,compact
10,audi,a4 quattro,2.0,2008,4,manual(m6),4,20,28,p,compact

### 1a. On average, which manufacturer has the best miles per gallon?

In [51]:
mpg['average_mileage'] = (mpg['cty'] + mpg['hwy']) / 2 #We need a column showing average mileage between city and highway

In [52]:
mpg.head(5) #We see that the new column has been added

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,average_mileage
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,23.5
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,25.0
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,25.5
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,25.5
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,21.0

In [53]:
mpg.groupby('manufacturer').average_mileage.mean()
#Now we can use .groupby to select all of the manufacturers, and then look at the 
#means of their values in the average_mileage column to get a sense of what their 
#average_mileage looks like for the manufacturer as a whole

manufacturer
audi          22.027778
chevrolet     18.447368
dodge         15.540541
ford          16.680000
honda         28.500000
hyundai       22.750000
jeep          15.562500
land rover    14.000000
lincoln       14.166667
mercury       15.625000
nissan        21.346154
pontiac       21.700000
subaru        22.428571
toyota        21.720588
volkswagen    25.074074
Name: average_mileage, dtype: float64

In [54]:
average_mileage_manufacturer = mpg.groupby('manufacturer').average_mileage.mean()
average_mileage_manufacturer.nlargest(1, keep='all')
#We can use the .nlargest method to select the row with the highest average average_mileage

manufacturer
honda    28.5
Name: average_mileage, dtype: float64

In [55]:
average_mileage_manufacturer.nlargest(1, keep='all').index[0]
#We can isolate the string describing this manufactuer using the .index[0] on our series

'honda'

In [56]:
print(f"On average, {average_mileage_manufacturer.nlargest(1, keep='all').index[0].capitalize()} is the manufacturer with the best mpg.")
#We can use print formatting to create a statement, and use .capitalize() to change the casing of the manufacturer's name

On average, Honda is the manufacturer with the best mpg.

### 1b. How many different manufacturers are there?

In [57]:
mpg['manufacturer'].unique()
#We can use the .unique() method on our 'manufacturer' column to create an array listing all of the manufacturers in the dataframe

array(['audi', 'chevrolet', 'dodge', 'ford', 'honda', 'hyundai', 'jeep',
       'land rover', 'lincoln', 'mercury', 'nissan', 'pontiac', 'subaru',
       'toyota', 'volkswagen'], dtype=object)

In [58]:
print(f"There are {len(mpg['manufacturer'].unique())} different manufacturers.")
#We can then use len() to programmatically count the number of manufacturers and pass that to a formatted print() function

There are 15 different manufacturers.

### 1c. How many different models are there?

In [59]:
mpg.model.unique()
#Similar to how we counted the number of manufacturers, we can create an array of unique models

array(['a4', 'a4 quattro', 'a6 quattro', 'c1500 suburban 2wd', 'corvette',
       'k1500 tahoe 4wd', 'malibu', 'caravan 2wd', 'dakota pickup 4wd',
       'durango 4wd', 'ram 1500 pickup 4wd', 'expedition 2wd',
       'explorer 4wd', 'f150 pickup 4wd', 'mustang', 'civic', 'sonata',
       'tiburon', 'grand cherokee 4wd', 'range rover', 'navigator 2wd',
       'mountaineer 4wd', 'altima', 'maxima', 'pathfinder 4wd',
       'grand prix', 'forester awd', 'impreza awd', '4runner 4wd',
       'camry', 'camry solara', 'corolla', 'land cruiser wagon 4wd',
       'toyota tacoma 4wd', 'gti', 'jetta', 'new beetle', 'passat'],
      dtype=object)

In [60]:
print(f"There are {len(mpg.model.unique())} different models.")
#And then use len() to count all of the elements of that array

There are 38 different models.

### 1d. Do automatic or manual cars have better miles per gallon?

In [61]:
#While the 'trans' column does contain distinctions between automatic and manual transmissions
#It also further specifies additional details in parenthesis
#If we used .groupby() to aggregate the unique strings in the 'trans' column, we would output more rows than the question seems to be implying
#We can clean this data by creating a new column that labels all automatic transmissions as 'auto' regardless of their details
#And labels all manual transmissions as 'manual' regardless of their details
#This will leave us with only two unique strings: 'auto' and 'manual' in a new column that we will call 'trans_simple'
mpg['trans_simple'] = mpg['trans'].apply(lambda x : x[0:4] if x[0:4] == 'auto' else x[0:6])

In [62]:
mpg.head()
#We see that we have successfully cleaned the strings from the 'trans' column and used them in the 'trans_simple' column

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,average_mileage,trans_simple
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,23.5,auto
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,25.0,manual
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,25.5,manual
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,25.5,auto
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,21.0,auto

In [63]:
mpg.groupby('trans_simple').average_mileage.mean()
#Using .groupby on our cleaned column and obtaining the mean average_mileage of 
#each transmission type gives us a series with two rows

trans_simple
auto      19.130573
manual    22.227273
Name: average_mileage, dtype: float64

In [64]:
mpg.groupby('trans_simple').average_mileage.mean().nlargest(1, keep='all')
#We can use .nlargest() to select only the row with the highest value

trans_simple
manual    22.227273
Name: average_mileage, dtype: float64

In [65]:
print(f"On average {mpg.groupby('trans_simple').average_mileage.mean().nlargest(1, keep='all').index[0]} cars have better mpg.")
#Then we can use .index[0] to isolate the index of that row to obtain the description and pass that into a formatted string

On average manual cars have better mpg.

## 2. Joining and Merging

#### Copy the users and roles dataframes from the examples above.

In [66]:
users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users
#We create a dataframe using the pd.DataFrame function and pass a dictionary as an argument

   id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN

In [67]:
roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles
#We create a dataframe using the pd.DataFrame function and pass a dictionary as an argument

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

###  2a. What do you think a right join would look like?

In [68]:
pd.merge(users, roles, left_on='role_id', right_on='id', how='right')
#A right join includes all columns from the right dataframe, 
#even if there are no corresponding matching values in the left dataframe
#Missing values in the left dataframe are given the NaN entry (not a number)

   id_x name_x  role_id  id_y     name_y
0   1.0    bob      1.0     1      admin
1   2.0    joe      2.0     2     author
2   3.0  sally      3.0     3   reviewer
3   4.0   adam      3.0     3   reviewer
4   NaN    NaN      NaN     4  commenter

### 2b. An outer join?

In [69]:
pd.merge(users, roles, left_on='role_id', right_on='id', how='outer')
#An outer join, the most useless of joins, contains every row from both dataframes
#There is not a need to have matching values between the primary key and the foreign key being used to join the dataframes
#All missing values are given the NaN value (not a number)

   id_x name_x  role_id  id_y     name_y
0   1.0    bob      1.0   1.0      admin
1   2.0    joe      2.0   2.0     author
2   3.0  sally      3.0   3.0   reviewer
3   4.0   adam      3.0   3.0   reviewer
4   5.0   jane      NaN   NaN        NaN
5   6.0   mike      NaN   NaN        NaN
6   NaN    NaN      NaN   4.0  commenter

### 2c. What happens if you drop the foreign keys from the dataframes and try to merge them?

In [84]:
users = users.drop(columns=['role_id'])
print(users)
#In this example, the dataframe 'users' has a foreign key 'role_id' 
# that matches the primary key 'id' in the dataframe 'roles'

   id   name
0   1    bob
1   2    joe
2   3  sally
3   4   adam
4   5   jane
5   6   mike

In [86]:
try:
    pd.merge(users, roles, left_on='role_id', right_on='id', how='outer')
except KeyError:
    print('You generated a KeyError!')
#If you dropped the 'role_id' from the 'users' dataframe, you would need to select another column to join on
#Otherwise you will generate a KeyError

You generated a KeyError!

In [87]:
pd.merge(users, roles, left_on='id', right_on='id', how='outer')
#The only numeric column that you could use at this point would be 'id', but these 'id' columns are not related to each other!
#Joining the 'id' column in 'users' to the 'id' column in 'roles' would give you a table
#But that table would grossly misrepresent the relationships between columns/in each row
#There is no user that has the role commenter! But in the output below, it is implied that adam is a commenter

   id name_x     name_y
0   1    bob      admin
1   2    joe     author
2   3  sally   reviewer
3   4   adam  commenter
4   5   jane        NaN
5   6   mike        NaN

## 3. Getting data from SQL databases

### 3a. Create a function named get_db_url. 
It should accept a username, hostname, password, and database name and return a url formatted like in the examples in this lesson.

In [91]:
from env import host, user, password 
#In the same directory as this script, we have an env.py file (included in our .gitignore)
#env.py consists of three lines of code:
#user = 'user_name' (user_name represents the user name - this is not the actual user name)
#host = '###.###.###.###' (# represents a digit)
#password = 'password' ('password' represents the password - this is not the actual password)

#By importing these variables in this way, the contents of them remain hidden to the public

#We create a function that can take in these variables as arguments
#We set the defaults to be equal to our imported variable names so that python uses those global variables
#We leave the database variable without a default, as we need to be sure we are calling from the correct table each time
def get_db_url(database, user=user, host=host, password=password): 
    #
    url = f'mysql+pymysql://{user}:{password}@{host}/{database}'
    return url

url = get_db_url('employees')
#We then store our complete url in a variable called url

### 3b. Use your function to obtain a connection to the employees database.

In [92]:
pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', url)
#Using .read_sql(), we enter a string containing our SQL query code and our stored url as arguments

   emp_no  birth_date first_name  last_name gender   hire_date
0   10051  1953-07-28   Hidefumi      Caine      M  1992-10-15
1   10052  1961-02-26     Heping     Nitsch      M  1988-05-21
2   10053  1954-09-13     Sanjiv   Zschoche      F  1986-02-04
3   10054  1957-04-04     Mayumi  Schueller      M  1995-03-13
4   10055  1956-06-06     Georgy     Dredge      M  1992-04-27

### 3c. Once you have successfully run a query:

#### Intentionally make a typo in the database url. What kind of error message do you see?
(Uncomment the top two lines to run the code that produces the error)

In [ ]:
#url = get_db_url('employees', password='beans')
#pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', url)
#OperationalError: (pymysql.err.OperationalError) (1045, "Access denied for user 'username'@'###.##.##.##' (using password: YES)")

In [ ]:
#url = get_db_url('supercooldatabase')
#pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', url)
#OperationalError: (pymysql.err.OperationalError) (1044, "Access denied for user 'username'@'%' to database 'supercooldatabase'")

In [ ]:
#url = get_db_url('employees', user='magicman')
#pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', url)
#OperationalError: (pymysql.err.OperationalError) (1045, "Access denied for user 'magicman'@'###.##.##.###' (using password: YES)")

In [ ]:
#url = get_db_url('employees', host='423.125')
#pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', url)
#OperationalError: (pymysql.err.OperationalError) (2003, "Can't connect to MySQL server on '423.125' ([Errno 8] nodename nor servname provided, or not known)")

#### Intentionally make an error in your SQL query. What does the error message look like?
(Uncomment the top line to run the code that produces the error)

In [ ]:
#pd.read_sql('SELECT * FROM employeeeeeeees LIMIT 5 OFFSET 50', url)
#ProgrammingError: (pymysql.err.ProgrammingError) (1146, "Table 'employees.employeeeeeeees' doesn't exist")

In [ ]:
#pd.read_sql('SELECTT * FROM employees LIMIT 5 OFFSET 50', url)
#ProgrammingError: (pymysql.err.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax

### 3d. Read the employees and titles tables into two separate dataframes